In [1]:
import pandas as pd

## Q1: Create a Series with indexes = 1, 2, 3 and has three names.

In [5]:
Data = ['Hanadi','Amal','Sara']
df = pd.Series(Data, index=[1,2,3])
df

1    Hanadi
2      Amal
3      Sara
dtype: object

## Q2: Change indexes to 11, 12, 13.

In [6]:
df = pd.Series(Data, index=[11,12,13])
df

11    Hanadi
12      Amal
13      Sara
dtype: object

## Q3: Retrieve First and second elements.

In [7]:
print(df[:2])

11    Hanadi
12      Amal
dtype: object

## Q4: Add duplicate elements, then remove the duplication.

In [11]:
add= {11: 'Hanadi', 12: 'Amal', 13:'Sara', 14: 'Hanadi', 15: 'Rawan', 16: 'Sara'}
df1 = pd.Series(add)
print('The DataFrame with duplicate elements:\n',df1)
df2 = df1.drop_duplicates()
print('\nThe DataFrame without duplicate elements:\n',df2)

The DataFrame with duplicate elements:
 11    Hanadi
12      Amal
13      Sara
14    Hanadi
15     Rawan
16      Sara
dtype: object

The DataFrame without duplicate elements:
 11    Hanadi
12      Amal
13      Sara
15     Rawan
dtype: object

## Q5: Create a Students DataFrame has three columns (ID, Name, GPA).

In [13]:
dataframe = {}
Df = pd.DataFrame(dataframe, columns=['ID','Name','GPA'])
Df

Empty DataFrame
Columns: [ID, Name, GPA]
Index: []

## Q6: Read educ_figdp_1_Data.csv file and print the head.

In [15]:
data1 = pd.read_csv('educ_figdp_1_Data.csv')
data1.head()

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
0,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e
3,2003,European Union (28 countries),Total public expenditure on education as % of ...,5.03,e
4,2004,European Union (28 countries),Total public expenditure on education as % of ...,4.95,e

## Q7: Give an example shows the difference between loc and slicing?
**Note:**
- loc use the index labels as references.
- slice use the position as references.

In [46]:
print('Show data using loc:\n', data1.loc[90:94, ['TIME', 'GEO']]) # rows and columns using labels
print('\n\nShow data using iloc:\n', data1.iloc[90:95,:2]) #rows and columns using positions

Show data using loc:
     TIME      GEO
90  2006  Belgium
91  2007  Belgium
92  2008  Belgium
93  2009  Belgium
94  2010  Belgium


Show data using iloc:
     TIME      GEO
90  2006  Belgium
91  2007  Belgium
92  2008  Belgium
93  2009  Belgium
94  2010  Belgium